export const menuLocales = {
  en: {
    title: "Your Weekly Menu",
    button: "Generate Weekly Menu 🍴",
    days: ["Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "Sunday"],
    breakfast: "Breakfast",
    dinner: "Dinner",
  },
  ru: {
    title: "Ваше Меню на Неделю",
    button: "Сгенерировать меню на неделю 🍴",
    days: ["Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "Воскресенье"],
    breakfast: "Завтрак",
    dinner: "Ужин",
  },
  uk: {
    title: "Ваше Меню на Тиждень",
    button: "Створити меню на тиждень 🍴",
    days: ["Понеділок", "Вівторок", "Середа", "Четвер", "Пʼятниця", "Субота", "Неділя"],
    breakfast: "Сніданок",
    dinner: "Вечеря",
  },
};

export const welcomeMessages = {
  en: "Welcome! Use /menu to generate your weekly menu or /help to see all commands.",
  ru: "Добро пожаловать! Нажмите /menu, чтобы сгенерировать меню на неделю или /help для списка команд.",
  uk: "Вітаємо! Натисніть /menu, щоб згенерувати меню на тиждень, або /help для списку команд.",
};

export const helpMessages = {
  en: "Available commands:\n/start - Start the bot\n/menu - Generate your weekly menu.",
  ru: "Доступные команды:\n/start - Начать работу с ботом\n/menu - Сгенерировать еженедельное меню.",
  uk: "Доступні команди:\n/start - Запустити бота\n/menu - Згенерувати меню на тиждень.",
};

export const errorMessages = {
  global: {
    en: "❌ Invalid action.",
    ru: "❌ Недопустимое действие.",
    uk: "❌ Неприпустима дія.",
  },
  menu: {
    en: "❌ Error generating menu. Please try again.",
    ru: "❌ Ошибка при создании меню. Пожалуйста, попробуйте снова.",
    uk: "❌ Помилка при створенні меню. Будь ласка, спробуйте ще раз.",
  },
  tooltip: {
    en: "❌ Failed to generate menu.",
    ru: "❌ Ошибка генерации меню.",
    uk: "❌ Помилка при створенні меню.",
  }
};

export const successMessages = {
  tooltip: {
    en: "✅ Menu generated successfully!",
    ru: "✅ Меню успешно сгенерировано!",
    uk: "✅ Меню успішно створено!",
  },
}

